[
    {
        "url": "http://tedmosbyisajerk.com",
        "group": "TV-Shows",
        "trivia": "Ted Mosby is a jerk.com is a website created by one of Barney's one night stands, Anna, to whom he uses the line 'Ted Mosby, Architect', in TV-show How I Met Your Mother."
    },
    {
        "url": "http://theslapbetcountdown.com",
        "group": "TV-Shows",
        "trivia": "The Slapsgiving count down timer runs before Marshal Eriksen's third slap on Barney Stinson in TV-show How I Met Your Mother."
    },
    {
        "url": "http://www.barneysvideoresume.com",
        "group": "TV-Shows",
        "trivia": "Barney Stinson shares his video resume to Robin Scherbatsky when he helps her make a video resume for herself in TV-show How I Met Your Mother."
    },
    {
        "url": "http://www.johnwatsonblog.co.uk",
        "group": "TV-Shows",
        "trivia": "The personal blog of Dr John Watson includes blog entries that describe cases investigated by Sherlock Holmes and himself from the BBC TV-Show Sherlock."
    },
    {
        "url": "http://www.knope2012.com",
        "group": "TV-Shows",
        "trivia": "Knope 2012 refers to Leslie Knope's campaign to run for the office of City Council in TV-show Parks and Recreation."
    },
    {
        "url": "http://www.pawneeindiana.com",
        "group": "TV-Shows",
        "trivia": "Pawnee, Indiana is the fictional setting for TV-show Parks and Recreation."
    },
    {
        "url": "http://www.savewalterwhite.com",
        "group": "TV-Shows",
        "trivia": "SaveWalterWhite.com is the website created by Walter White Jr. in order to raise donation money for his father's rising medical costs in TV-show Breaking Bad."
    },
    {
        "url": "http://www.wuphf.com",
        "group": "TV-Shows",
        "trivia": "Wuphf.com is a fictional website and social tool developed by Ryan Howard, but allegedly stolen from his then girlfriend Kelly Kapoor, in TV-show The Office."
    },
    {
        "url": "https://creedthoughtsgov.com",
        "group": "TV-Shows",
        "trivia": "Creed Thoughts is a blog Ryan Howard made for Creed Bratton in TV-show The Office."
    },
    {
        "url": "https://www.goliathbank.com",
        "group": "TV-Shows",
        "trivia": "Goliath National Bank, the world leader in credit and banking, is the bank where Barney Stinson works in TV-show How I Met Your Mother."
    }
]